tontine/app/Controllers/Utilisateur.php

    public function index()
    {
        $data=[
            'titre'=>'Sama Tontine::Connexion',
            'menuActif'=> 'connexion',
        ];

        if($this->request->getMethod()=='post'){
            $reglesValid=[
                "login"=>["rules" =>"required",
                          "errors"=>["required"=>"le login est obligatoire"]],
                "motPasse"=>["rules"=>"required|validateUser[login,motPasse]",
                             "errors"=>["required"=>"Le mot de passe est obligatoire",
                                         "validateUser" => "Email et/ou mot de passe incorrect(s)" ]]

            ];
            if( ! $this->validate($reglesValid)){
                $data["validation"]=$this->validator;
            }else {
                $model=new AdherentModel();
                $user=$model->where('login',$this->request->getPost('login'))
                            ->where('motPasse',$this->request->getPost('motPasse'))
                            ->first();
---
SELECT *
FROM `adherent`
WHERE `login` = 'awa'
AND `motPasse` = '123456'
 LIMIT 1