tontine/app/Validation/UtilisateurRules.php

SELECT *
FROM `adherent`
WHERE `login` = 'awa'
AND `motPasse` = '123456'
 LIMIT 1
---
    public function validateUser(string $str, string $fields, array $data){
        $model= new AdherentModel();
        $user=$model->where('login',$data["login"])
                    ->where('motPasse',$data["motPasse"])
                    ->first();